Revit 2027 API
ParameterTypeId.WallTopIsAttached Property
 "Top is Attached"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallTopIsAttached { get; }
Public Shared ReadOnly Property WallTopIsAttached As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallTopIsAttached {
	ForgeTypeId^ get ();
}
static member WallTopIsAttached : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace